# Arithmetic Operator

In [7]:
print(3 + 5)

8

In [2]:
print(2 * 3)

6

In [4]:
print( 4 - 6)

-2

In [3]:
print(4 / 8)

0.5

# Comaprison Operators

In [5]:
5 > 4

True

In [8]:
 4 < 8

True

In [9]:
4 >= 4

True

In [10]:
45 == 45

True

In [11]:
45 >= 85

False

# Logical Operator

In [12]:
4 and 0

0

In [13]:
0 and 9

0

In [14]:
3 and 8

8

In [15]:
4 or 0

4

In [16]:
0 or 8

8

In [17]:
not(9 or 0)

False

In [18]:
not(9 and 0)

True

# Variables and Data Types

In [19]:
i = 5
j = i 
j = 3
print(i)

5

In [23]:
a = 5
print(a)

5

In [24]:
A = 4
print(a)
print(A)

5
4

# How Variable works in Python

In [27]:
a = 7
b = a 
a = 3
print(a)
print(b)

3
7

# Conditional Statements

In [1]:
x = 5

if(x % 2 == 0):
    print("Even")
else:
    print("Odd")

Odd

# Loop

In [40]:
for i in range(11,50):
    print(i)

11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49

In [41]:
for i in range(11,50,2):
    print(i)

11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49

# Function

In [51]:
def compare(a,b):
    if(a > b):
        greater = a
    else:
        greater = b
        
        return greater

In [52]:
compare(10,50)

50

# List

In [3]:
list = [1, 'Awesome', 8 ]
list[1:2]

['Awesome']

In [6]:
list3 = [1, 'Hello', 8, 'Kanishk']
list3.append(9)
list3`

[1, 'Hello', 8, 'Kanishk', 9]

In [7]:
list3.extend([5,'Hello'])
list3

[1, 'Hello', 8, 'Kanishk', 9, 5, 'Hello']

In [12]:
list4 = [5, 'hello', 890, 'yu']
list4.remove(5)
list4

['hello', 890, 'yu']

In [14]:
del list4[0]
list4

[890, 'yu']

In [11]:
for i in list3:
    print(i)

1
Hello
8
Kanishk
9
5
Hello

In [15]:
marks =[1,2,3,4,5,6,7,8,9,10]
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [16]:
marks[5]

6

In [17]:
marks[0:6]

[1, 2, 3, 4, 5, 6]

In [18]:
marks.append(11)
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [19]:
marks.extend([12,13,14])
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [20]:
marks.append([15,16])
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, [15, 16]]

In [22]:
marks.remove([15,16])
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [23]:
del marks[0]
marks

[2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [25]:
for mark in marks:
    print(mark)

2
3
4
5
6
7
8
9
10
11
12
13
14

# Dictionary

In [33]:
marks7={'History':45, 'Geography':54, 'Hindi':56}
marks7

{'History': 45, 'Geography': 54, 'Hindi': 56}

In [34]:
marks7['Geography']

54

In [39]:
marks7['English']=47
marks7

{'History': 45, 'Geography': 54, 'Hindi': 56, 'English': 47}

In [40]:
marks7.update({'Chemistry':89, 'Physics':98})
marks7

{'History': 45,
 'Geography': 54,
 'Hindi': 56,
 'English': 47,
 'Chemistry': 89,
 'Physics': 98}

In [42]:
del marks7['Hindi']

In [43]:
marks7

{'History': 45, 'Geography': 54, 'English': 47, 'Chemistry': 89, 'Physics': 98}

# Tuples

# Standard Library of Python

# Basics of Pandas (Import)

In [20]:
import pandas as pd

In [21]:
df=pd.read_csv("annual-enterprise-survey-2020-financial-year-provisional-csv.csv")

In [22]:
df.head()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2020,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"733,258",ANZSIC06 divisions A-S (excluding classes K633...
1,2020,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"660,630",ANZSIC06 divisions A-S (excluding classes K633...
2,2020,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"54,342",ANZSIC06 divisions A-S (excluding classes K633...
3,2020,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"18,285",ANZSIC06 divisions A-S (excluding classes K633...
4,2020,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,872",ANZSIC06 divisions A-S (excluding classes K633...

In [24]:
df1=pd.read_excel("kanishk.xlsx")

In [25]:
df1.head()

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468

# Basic operation on Pandas

In [26]:
df.shape

(37080, 10)

In [27]:
df1.shape

(1000, 8)

In [28]:
df.head()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2020,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"733,258",ANZSIC06 divisions A-S (excluding classes K633...
1,2020,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"660,630",ANZSIC06 divisions A-S (excluding classes K633...
2,2020,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"54,342",ANZSIC06 divisions A-S (excluding classes K633...
3,2020,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"18,285",ANZSIC06 divisions A-S (excluding classes K633...
4,2020,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,872",ANZSIC06 divisions A-S (excluding classes K633...

In [29]:
df.tail()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
37075,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
37076,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
37077,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
37078,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
37079,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [30]:
df1.tail()

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
995,996,Roma,Lafollette,Female,United States,34,15/10/2017,2654
996,997,Felisa,Cail,Female,United States,28,16/08/2016,6525
997,998,Demetria,Abbey,Female,United States,32,21/05/2015,3265
998,999,Jeromy,Danz,Male,United States,39,15/10/2017,3265
999,1000,Rasheeda,Alkire,Female,United States,29,16/08/2016,6125

In [31]:
df.head(10)

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2020,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"733,258",ANZSIC06 divisions A-S (excluding classes K633...
1,2020,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"660,630",ANZSIC06 divisions A-S (excluding classes K633...
2,2020,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"54,342",ANZSIC06 divisions A-S (excluding classes K633...
3,2020,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"18,285",ANZSIC06 divisions A-S (excluding classes K633...
4,2020,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,872",ANZSIC06 divisions A-S (excluding classes K633...
5,2020,Level 1,99999,All industries,Dollars (millions),H09,Interest and donations,Financial performance,"32,730",ANZSIC06 divisions A-S (excluding classes K633...
6,2020,Level 1,99999,All industries,Dollars (millions),H10,Indirect taxes,Financial performance,"7,509",ANZSIC06 divisions A-S (excluding classes K633...
7,2020,Level 1,99999,All industries,Dollars (millions),H11,Depreciation,Financial performance,"26,821",ANZSIC06 divisions A-S (excluding classes K633...
8,2020,Level 1,99999,All industries,Dollars (millions),H12,Salaries and wages paid,Financial performance,"119,387",ANZSIC06 divisions A-S (excluding classes K633...
9,2020,Level 1,99999,All industries,Dollars (millions),H13,Redundancy and severance,Financial performance,305,ANZSIC06 divisions A-S (excluding classes K633...

In [34]:
df.columns

Index(['Year', 'Industry_aggregation_NZSIOC', 'Industry_code_NZSIOC',
       'Industry_name_NZSIOC', 'Units', 'Variable_code', 'Variable_name',
       'Variable_category', 'Value', 'Industry_code_ANZSIC06'],
      dtype='object')

In [33]:
df1.columns

Index(['Unnamed: 0', 'First Name', 'Last Name', 'Gender', 'Country', 'Age',
       'Date', 'Id'],
      dtype='object')

In [79]:
df['Variable_code']

0        H01
1        H04
2        H05
3        H07
4        H08
        ...
37075    H37
37076    H38
37077    H39
37078    H40
37079    H41
Name: Variable_code, Length: 37080, dtype: object

In [80]:
df1['Gender']

0      Female
1      Female
2        Male
3      Female
4      Female
        ...
995    Female
996    Female
997    Female
998      Male
999    Female
Name: Gender, Length: 1000, dtype: object

In [82]:
df[['Value', 'Variable_code']]

         Value Variable_code
0      733,258           H01
1      660,630           H04
2       54,342           H05
3       18,285           H07
4      654,872           H08
...        ...           ...
37075       52           H37
37076       40           H38
37077       12           H39
37078        5           H40
37079       46           H41

[37080 rows x 2 columns]

# More Operations on Data Frame of Pandas

In [35]:
df=pd.read_csv('Module Test 1.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'Module Test 1.csv'

In [84]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [85]:
df.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [86]:
df.shape

(614, 13)

In [87]:
df['Gender']

0        Male
1        Male
2        Male
3        Male
4        Male
        ...
609    Female
610      Male
611      Male
612      Male
613    Female
Name: Gender, Length: 614, dtype: object

In [88]:
df[['Married', 'Education']]

    Married     Education
0        No      Graduate
1       Yes      Graduate
2       Yes      Graduate
3       Yes  Not Graduate
4        No      Graduate
..      ...           ...
609      No      Graduate
610     Yes      Graduate
611     Yes      Graduate
612     Yes      Graduate
613      No      Graduate

[614 rows x 2 columns]

In [91]:
df.iloc[:5]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [92]:
df.iloc[:,:2]

      Loan_ID  Gender
0    LP001002    Male
1    LP001003    Male
2    LP001005    Male
3    LP001006    Male
4    LP001008    Male
..        ...     ...
609  LP002978  Female
610  LP002979    Male
611  LP002983    Male
612  LP002984    Male
613  LP002990  Female

[614 rows x 2 columns]

In [95]:
df[df['Gender']=='Male']

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
607,LP002964,Male,Yes,2,Not Graduate,No,3987,1411.0,157.0,360.0,1.0,Rural,Y
608,LP002974,Male,Yes,0,Graduate,No,3232,1950.0,108.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y

In [18]:
#PrintingSpecificColumnsorows

df.iloc[:,3:5]

NameError: name 'df' is not defined

# Statistics

In [4]:
import pandas as pd

In [5]:
data = pd.read_csv("annual-enterprise-survey-2020-financial-year-provisional-csv.csv")

In [6]:
data.head()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2020,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"733,258",ANZSIC06 divisions A-S (excluding classes K633...
1,2020,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"660,630",ANZSIC06 divisions A-S (excluding classes K633...
2,2020,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"54,342",ANZSIC06 divisions A-S (excluding classes K633...
3,2020,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"18,285",ANZSIC06 divisions A-S (excluding classes K633...
4,2020,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,872",ANZSIC06 divisions A-S (excluding classes K633...

In [8]:
# Priting Mode 
mode_data = data['Year'].mode()

In [9]:
print(mode_data)

0    2013
1    2014
2    2015
3    2016
4    2017
5    2018
6    2019
7    2020
dtype: int64

In [19]:
# Printing a Mean 
mean_data = data['Year'].mean()

In [13]:
print(mean_data)

2016.5

In [14]:
mode_data = data['Year'].mode()
print(mode_data)

0    2013
1    2014
2    2015
3    2016
4    2017
5    2018
6    2019
7    2020
dtype: int64